from django.shortcuts import render

# Create your views here.

def index(request):
    return render(request, "input.html")


def transliterate(request):

    str = request.POST['str']

    dictionary = {'а':'a','б':'b','в':'v','г':'g','д':'d','е':'e','ё':'e',
      'ж':'zh','з':'z','и':'i','й':'i','к':'k','л':'l','м':'m','н':'n',
      'о':'o','п':'p','р':'r','с':'s','т':'t','у':'u','ф':'f','х':'h',
      'ц':'c','ч':'cz','ш':'sh','щ':'scz','ъ':'','ы':'y','ь':'','э':'e',
      'ю':'u','я':'ja', 'А':'A','Б':'B','В':'V','Г':'G','Д':'D','Е':'E','Ё':'E',
      'Ж':'ZH','З':'Z','И':'I','Й':'I','К':'K','Л':'L','М':'M','Н':'N',
      'О':'O','П':'P','Р':'R','С':'S','Т':'T','У':'U','Ф':'F','Х':'H',
      'Ц':'C','Ч':'CZ','Ш':'SH','Щ':'SCH','Ъ':'','Ы':'y','Ь':'','Э':'E',
      'Ю':'U','Я':'YA',',':'','?':'','~':'','!':'','@':'','#':'', 
      '$':'','%':'','^':'','&':'','*':'','(':'',')':'','-':'','=':'','+':'',
      ':':'',';':'','<':'','>':'','\'':'','"':'','\\':'','/':'','№':'',
      '[':'',']':'','{':'','}':'','ґ':'','ї':'', 'є':'','Ґ':'g','Ї':'i',
      'Є':'e', '—':''}
        
    for key in dictionary:
        str = str.replace(key, dictionary[key])

    return render(request, "result.html", {"result": str})
    #else:
    #    res = "Only digits are allowed"
    #    return render(request, "result.html", {"result": num1})

def transliterate_eng(request):

    str = request.POST['str']

    dictionary_eng = {
    'a': 'а', 'b': 'б', 'v': 'в', 'g': 'г', 'd': 'д', 'e': 'е', 'e': 'ё', 'zh': 'ж', 'z': 'з', 'i': 'и', 'k': 'к', 'l': 'л',
    'm': 'м', 'n': 'н', 'o': 'о', 'p': 'п', 'r': 'р', 's': 'с', 't': 'т', 'u': 'у', 'f': 'ф', 'h': 'х', 'c': 'ц', 'cz': 'ч',
    'sh': 'ш', 'sc': 'щ', 'y': 'ы', 'b': 'ь', 'e': 'э', 'u': 'ю', 'ja': 'я', 'A': 'А', 'B': 'Б', 'V': 'В', 'G': 'Г', 'D': 'Д',
    'E': 'Е', 'E': 'Ё', 'ZH': 'Ж', 'Z': 'З', 'I': 'И', 'I': 'Й', 'K': 'К', 'L': 'Л', 'M': 'М', 'N': 'Н', 'O': 'О', 'P': 'П',
    'R': 'Р', 'S': 'С', 'T': 'Т', 'U': 'У', 'F': 'Ф', 'H': 'Х', 'C': 'Ц', 'C': 'Ч', 'SH': 'Ш', 'SCH': 'Щ', 'y': 'Ы', 'b': 'Ь',
    'E': 'Э', 'U': 'Ю', 'YA': 'Я', ',': ',', '?': '?', '~': '~', '!': '!', '@': '@', '#': '#', '$': '$', '%': '%', '^': '^',
    '&': '&', '*': '*', '(': '(', ')': ')', '-': '-', '=': '=', '+': '+', ':': ':', ';': ';', '<': '<', '>': '>', '\'': '\'', '"': '"',
    '\\': '\\', '/': '/', '№': '#', '[': '[', ']': ']', '{': '{', '}': '}', '—': '-', 'W':'В', 'w':'в'}
        
    for key in dictionary_eng:
        str = str.replace(key, dictionary_eng[key])

    return render(request, "result.html", {"result": str})
    #else:
    #    res = "Only digits are allowed"
    #    return render(request, "result.html", {"result": num1})
